export const introduce_data = [
  {
    id: 0,
    title: "💻프론트엔드와의 만남",
    content: [
      {
        subtitle: "🙋‍♂️계기",
        subcontent: `
        처음 프로그래밍을 접했을 때, 막연하게 웹개발자가 되고 싶다는 생각을 했습니다.
        꿈을 위해 교육학원에서 당시 자바가 가장 유망했던 언어였기에 자바를 기반으로 한 커리큘럼을 수강 후 인턴 활동을 하였습니다.
        그 인턴 활동을 경험하기 전까지, 단순하게 프론트엔드라는 영역은 화면으로 직접 확인할 수 있는 것. 즉, 디자인의 영역이라고 생각했었습니다.
        하지만, 화면에 뿌려줘야하는 데이터들을 핸들링하기 편하게 가공하고, 사용자의 편의성을 고려하면서 개발을 진행하는 과정에
        크게 흥미를 느껴 웹개발자(프론트엔드) 영역으로 진로를 확실히 정하게 되었습니다.
        `,
      },

      {
        subtitle: "🌀과정",
        subcontent: `
        아무런 프레임워크 없이 순수 html과 css 그리고 JS만을 통해서 아주 간단한 사이드 프로젝트를 진행하였습니다.
        이후에는 React나 TS와 같은 기술을 개인적으로 공부하고, 현재 재직 중인 회사의 Legacy한 페이지들을 리뉴얼하는 과정에 있습니다.
        `,
      },

      {
        subtitle: "🚶천천히, 꾸준하게",
        subcontent: `
        개발을 진행하다보면, '아직도 모르는게 많구나..', '아직 한참 더 공부해야겠구나..' 라는 생각을 자주합니다.
        제 성격 중 하나가 '생각이 났을 때, 일단 바로바로 실천하자' 라는 것인데 아직 부족하다는 생각이 들때면 바로 관련 아티클이나
        기술 블로그들의 포스팅들을 보며 학습하면서, 먼저 로컬 환경에서 적용해보고 테스트 결과 이슈 사항 없이 진행됐다면, 바로 주변 선임이나 동료들과 소통/협업하며
        어제보다 더 나은 내가 될 수 있게 성장하고 있습니다.
        `,
      },
    ],
  },

  {
    id: 1,
    title: "👨‍💻소통 중심",
    content: [
      {
        subtitle: `🤝개인보다 나은 팀`,
        subcontent: `
          저는 풋살과 축구를 취미로 하고 있습니다. 항상 경기를 진행하다보면 팀워크가 잘 맞아야 경기를 이길 수 있고 좋은 경기력을 보여줄 수 있다는 것을 매번 체감합니다.
          어떨 때에는 동료들과 움직임이 서로 맞지 않는 경우도 있고, 서로의 기량을 제대로 모르는 상태에서 무리한 요구를 할 수도 있습니다. 팀워크를 향상시키기 위해선
          의사소통이 중요하다고 생각합니다. 현재 상황의 문제점에 대해서 이야기하며 피드백을 나누면 타협점을 찾게 되고, 최선의 선택을 하게 된다고 생각합니다.
          풋살과 축구에 국한해서 의사소통의 중요성이 통용된다고 생각하지 않습니다. 모든 업무, 작업, 인간관계에서 가장 기본이 된다고 생각합니다.
          직장에서 개발을 진행할 때에도 [기획자/디자이너]분들과 실현 가능한 부분, 일정에 조정이 필요한 부분 등을 서로 소통하고 진척율이 50% 정도 됐을 때면
          같은 프로젝트를 진행하는 팀원들과 중간 검수를 하면서 피드백을 받고 더 좋은 방안 등을 적용하며, 리팩토링 하면서 개발을 진행하고 있습니다.
        `,
      },
    ],
  },

  {
    id: 2,
    title: "💭개발자로서 가치관",
    content: [
      {
        subtitle: `🔥승부욕`,
        subcontent: `전 승부욕이 있는 편입니다. 다른 사람과의 경쟁하는 보통의 승부욕이 아니라, 나 자신에게 승부욕을 갖고 있습니다.
        이왕 이 직종에 몸을 담았다면, 이 분야에서 스스로가 떳떳하고 싶다라는 생각을 자주하곤 합니다. 물론, 생각하는 이상과 마주하는 현실과의 괴리감은 분명 존재하기에
        업무를 진행할 때나, 학습을 진행할 때 번아웃이나 슬럼프가 올 때도 있습니다. 그럴 때에는 잠시 3~4일 정도 휴식을 취하며 내가 나를 돌 볼 시간을 충분히 가진 뒤, 다시 내 위치에서
        할 수 있는 최선을 다하고자 합니다.
        `,
      },

      {
        subtitle: `🐢거북이`,
        subcontent: `모르는 것을 학습 할 때에는, 항상 더딘 걸음으로 학습합니다. 생각하기에 여러 개를 얕게 아는 것보단, 한 개를 확실히 아는 것이 더 가치 있다고 느낍니다.
        그렇기에 학습시엔 항상 복기/복습하는 시간을 60% 정도 할애를 하다 보니 다음 진도로의 진행이 더딥니다. 하지만 예를 들어 강의를 완강했을 때, 다른 수강생들보다 더욱 깊이 있는
        이해도를 갖고 있다고 확신합니다. 프로젝트를 진행할 때에 이슈 사항이 발생했다면, 기한이 정해져있으니 먼저 구글링 등의 서칭을 통해 솔루션 찾은 뒤, 후에 시간적 여유가 있을 때 해당 솔루션에
        대해 어떤 방식으로 작동하는지 이해하는 과정을 항상 거치면서 따로 기록하고 있습니다.
        `,
      },
    ],
  },

  {
    id: 3,
    title: "♻️공유 문화 선호",
    content: [
      {
        subtitle: `🧑‍🤝‍🧑혼자 보단 우리`,
        subcontent: `내가 알고 있는 것을 나 혼자만 알고 있는 것보단, 다른 사람과 공유할 때 그 영향력이 더 증가한다고 믿고있습니다. 예를들어 어떤 업무를 진행하게 될 때에 나는 이미 마주했었던
        이슈 사항을 다른 동료도 똑같이 겪고 있다면 문제 원인과 해결 방안을 공유하고 업무를 진행하는 것이 더 효율적이고, 후에 같은 이슈를 겪는 사람을 봤을 때 도와줄 수 있는 인력도 늘어나기에
        일석이조의 효과가 기대됩니다. 결국 스스로도 누군가의 정보와 지식을 공유 받아서 업무를 진행하는 것이라 생각해서, 학습/업무면에서도 다른 사람에게 똑같이 공유해주는 것이 옳다고 생각하며 어떤 일이든 진행하고 있습니다.`,
      },
    ],
  },
];
