export const introduce_data = [
  {
    id: 0,
    title: "💻프론트엔드와의 만남",
    content: [
      {
        subtitle: "🙋‍♂️계기",
        subcontent: `
        인턴 활동을 경험하기 전까지, 프론트엔드는 100% 디자인이라고 생각했습니다. 하지만, 화면에 뿌려줘야하는 데이터들을 핸들링하기 편하게 가공하고, 사용자의 편의성을 고려하면서 개발을 진행하는 과정에
        흥미를 느껴 FE개발자로로 진로를 확실히 정하게 되었습니다.
        `,
      },

      {
        subtitle: "🌀과정",
        subcontent: `
        아무런 프레임워크 없이 순수 html과 css 그리고 JS만을 통해서 아주 간단한 사이드 프로젝트를 진행하였습니다.
        이후에는 React나 TS와 같은 기술을 개인적으로 공부하고, 현재 재직 중인 회사의 Legacy한 페이지들을 리뉴얼하는 과정에 있습니다.
        `,
      },

      {
        subtitle: "🚶천천히, 꾸준하게",
        subcontent: `
        개발을 진행하다보면, '아직 한참 더 공부해야겠구나..' 라는 생각을 자주합니다.
        그런 생각이 들때면 관련 포스팅들을 보며 학습하면서, 로컬 환경에서 구동해보고 테스트해봅니다.
        어제보다 더 나은 내가 될 수 있게 성장하고 있습니다.
        `,
      },
    ],
  },

  {
    id: 1,
    title: "👨‍💻소통 중심",
    content: [
      {
        subtitle: `🤝개인보다 나은 팀`,
        subcontent: `
          의사소통을 모든 업무, 작업, 인간관계에서 가장 중요하게 여깁니다. 
          개발을 진행할 때에도 [기획자/디자이너]분들과 구현 가능한 부분, 조정이 필요한 부분들을 서로 조율하고
          팀원들과 중간 검수를 하면서 피드백을 받고, 리팩토링 하면서 개발을 진행하고 있습니다.
        `,
      },
    ],
  },

  {
    id: 2,
    title: "💭개발자로서 가치관",
    content: [
      {
        subtitle: `🔥승부욕`,
        subcontent: `전 승부욕이 있습니다. 다른 사람과의 경쟁이 아닌 스스로에게 승부욕을 갖고 있습니다. 스스로가 떳떳하고 싶다라는 생각을 자주하곤 합니다.
        물론 이상이 지나쳐 업무, 학습을 진행할 때 번아웃이 올 때도 있습니다. 그때에는 잠시 3~4일 정도 휴식을 취하고, 다시 지금 위치에서
        할 수 있는 최선을 다하고자 합니다.
        `,
      },

      {
        subtitle: `🐢거북이`,
        subcontent: `여러 개를 얕게 아는 것보단, 한 개를 확실히 아는 것이 더 가치 있다고 느낍니다. 그렇기에 학습시엔 항상 복기/복습하는 시간을 60% 정도 할애 합니다.
        예를 들어 강의를 완강, Docs를 완독했을 때, 다른 인원보다 더 깊이 있는 이해도를 갖고 있다고 확신합니다.
        `,
      },
    ],
  },

  {
    id: 3,
    title: "♻️공유 문화 선호",
    content: [
      {
        subtitle: `🧑‍🤝‍🧑혼자 보단 우리`,
        subcontent: `나 혼자만 알고 있는 것보단, 다른 사람과 공유할 때 발전한다고 믿습니다. 이미 겪은
        이슈를 다른 동료도 겪고있다면 경험을 공유하는 것이 더 효율적이고, 후에 같은 이슈를 겪는 인원을 도와줄 수 있는 인력도 늘어나는 효과가 있습니다.
        모두가 함께 발전할 수 있는 공유 문화를 선호합니다.`,
      },
    ],
  },
];
